# GetTableData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..GetTableData Method
ViewSchedule Class See Also
---
Gets the writable table data object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public TableData GetTableData()
```

Visual Basic
---
```text
Public Function GetTableData As TableData
```

Visual C++
---
```text
public:
TableData^ GetTableData()
```

# ### Return Value
The schedule data object.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace